# coding=gbk

# 第一步，引入pyhanlp包：
from pyhanlp import *
import time
# 第二步，进行词性切分：
texts = '陆星儿简介陆星儿，祖籍江苏海门，出版长篇小说五部、散文集7部、中短篇小说集10部、影视剧多部。陆星儿最让人敬佩的是毅力。本报讯（记者甘丹）9月4日晚8时30分，著名女作家陆星儿因癌症医治无效，在上海去世，享年55岁。记者了解到，陆星儿的病情一直就非常严重。在经过第二次手术以后，癌症细胞甚至已经扩散到了全身很多器官。然而她并不太愿意大家过多地提到她的病情，她总是不断地鼓励自己，希望自己能坚强地活下去。陆星儿在生病期间创作了长篇小说《痛》、以及长篇散文《用力呼吸———陆星儿生命日记》，这对于一个身患癌症的人来说是件极其不容易的事情。因《寻枪》而出名的导演陆川是陆星儿的侄子，他非常伤心，并告诉记者他父亲、陆星儿的哥哥著名作家陆天明更为悲伤，已经飞赴上海。作家陈村在接受记者采访时说：“她在生命的最后，有儿子和许多朋友陪在她的身边，也许还算一种安慰吧。”亲友追忆]陆川：有这样的姑姑我很荣幸在明白记者采访目的后，陆川沉默了好几秒。然后他说：“我真的非常伤心。”昨天晚上做完了《可可西里》的拷贝，试放到电影结尾时，接到了父亲（陆天明）的电话，他告诉我星儿姑姑去世了，真的非常伤心。我本来应该去上海的，但现在正赶着做《可可西里》的拷贝，离不开。我父母今天早上已经飞回上海，我随后再过去。姑姑对我很好，我也很喜欢他。一直以来我都以有一个这样的姑姑而感到荣幸，因为她和我的父亲都是从事文学的，我觉得很了不起。她的病痛让她很痛苦，但是姑姑却很坚强。现在离开对她来说也许是一种解脱，我相信在另外一个国度或者世界，姑姑一定得到了永恒！陈村：她的一生都是坎坷的陆星儿平时是一个很低调的人，从不炒作。在工作上，她却特别的刻苦、勤劳。回想她的一生，是那么的不顺利。她从年轻时下乡到北大荒，到后来离婚一个人带着儿子生活，再到生病都是坎坎坷坷的，我们这些朋友在心里都很为她难过。她的儿子叫陈厦，为什么呢？那是因为，当年她怀着孩子的时候，大着肚子坐在她丈夫的自行车上到处奔波，就是为了找房子。他们来来回回搬了许多次家，很长一段时间都是处于这种颠簸的状态，所以她就给孩子取名叫陈厦，希望自己的下一代不会再有这样的经历。她平时很节俭，总是把经历放在了工作上、友情上。上个月我最后一次见到她的时候，她又比以前瘦了好多。我们其实也就料想到了结局，但是这结局又不免让我们难过。陆星儿简介陆星儿，祖籍江苏海门，1949年11月生于上海。1968年前在上海读书；1978年考入中央戏剧学院戏剧文学系；1982年始任中国儿童艺术剧院编剧；1983年加入中国作家协会，生前为上海作家协会专业作家。出版长篇小说五部、散文集7部、中短篇小说集10部、影视剧多部。'

def demo_perceptron_lexical_analyzer(tests):
    """ 基于感知机序列标注的词法分析器，默认模型训练自1998人民日报语料1月份。欢迎在更大的语料库上训练，以得到更好的效果。
        无论在何种语料上训练，都完全支持简繁全半角和大小写。
        [['陆星儿/nr', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w', '陆星儿/u', '最让人/n', '敬佩/v', '的/u', '是/v', '毅力/n', '。/w', '本报讯/y', '（/w', '记者/n', '甘丹/nrf', '）/w', '9月4日/t', '晚/Tg', '8时30分/t', '，/w', '著名/a', '女/b', '作家/n', '陆星儿/nr', '因/p', '癌症/n', '医治无效/nz', '，/w', '在/p', '上海/ns', '去世/v', '，/w', '享年/n', '55/m', '岁/q', '。/w', '记者/n', '了解到/v', '，/w', '陆星儿/nr', '的/u', '病情/n', '一直/d', '就/d', '非常/d', '严重/a', '。/w', '在/p', '经过/p', '第二次/m', '手术/v', '以后/f', '，/w', '癌症/n', '细胞/n', '甚至/d', '已经/d', '扩散/v', '到/v', '了/u', '全身/n', '很多/m', '器官/n', '。/w', '然而/c', '她/r', '并不/d', '太/d', '愿意/v', '大家/r', '过多/d', '地/u', '提到/v', '她/r', '的/u', '病情/n', '，/w', '她/r', '总是/d', '不断/d', '地/u', '鼓励/v', '自己/r', '，/w', '希望/v', '自己/r', '能/v', '坚强/a', '地/u', '活/v', '下去/v', '。/w', '陆星儿/nr', '在/p', '生病/vn', '期间/f', '创作/v', '了/u', '长篇小说/l', '《/w', '痛/a', '》/w', '、/w', '以及/c', '长篇/b', '散文/n', '《/w', '用力/v', '呼吸/v', '———/w', '陆星儿/nr', '生命/n', '日记/n', '》/w', '，/w', '这/r', '对于/p', '一个/m', '身患/v', '癌症/n', '的/u', '人/n', '来说/u', '是/v', '件/q', '极其/d', '不/d', '容易/a', '的/u', '事情/n', '。/w', '因/p', '《/w', '寻/v', '枪/n', '》/w', '而出名/i', '的/u', '导演/n', '陆川/nr', '是/v', '陆星儿/nr', '的/u', '侄子/n', '，/w', '他/r', '非常/d', '伤心/a', '，/w', '并/c', '告诉/v', '记者/n', '他/r', '父亲/n', '、/w', '陆星儿/nr', '的/u', '哥哥/n', '著名作家/n', '陆天明/nr', '更为/d', '悲伤/a', '，/w', '已经/d', '飞赴/v', '上海/ns', '。/w', '作家/n', '陈村/ns', '在/p', '接受/v', '记者/n', '采访/vn', '时说/n', '：/w', '“/w', '她/r', '在/p', '生命/n', '的/u', '最后/f', '，/w', '有/v', '儿子/n', '和/c', '许多/m', '朋友/n', '陪/v', '在/p', '她/r', '的/u', '身边/s', '，/w', '也许/d', '还算/v', '一/m', '种/q', '安慰/an', '吧/y', '。/w', '”/w', '亲友/n', '追忆/v', ']/w', '陆川/nr', '：/w', '有/v', '这样/r', '的/u', '姑姑/n', '我/r', '很/d', '荣幸/a', '在/p', '明白/v', '记者/n', '采访/vn', '目的/n', '后/f', '，/w', '陆川/ns', '沉默/a', '了/u', '好几/m', '秒/q', '。/w', '然后/c', '他/r', '说/v', '：/w', '“/w', '我/r', '真的/l', '非常/d', '伤心/a', '。/w', '”/w', '昨天晚上/nz', '做完/v', '了/u', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '试/v', '放到/v', '电影/n', '结尾/n', '时/Ng', '，/w', '接到/v', '了/u', '父亲/n', '（/w', '陆天明/nr', '）/w', '的/u', '电话/n', '，/w', '他/r', '告诉/v', '我/r', '星儿/nz', '姑姑/n', '去世/v', '了/y', '，/w', '真的/z', '非常/d', '伤心/a', '。/w', '我/r', '本来/d', '应该/v', '去/v', '上海/ns', '的/u', '，/w', '但/c', '现在/t', '正/d', '赶/v', '着/u', '做/v', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '离不开/v', '。/w', '我/r', '父母/n', '今天/t', '早上/t', '已经/d', '飞回/v', '上海/ns', '，/w', '我/r', '随后/d', '再/d', '过去/v', '。/w', '姑姑/n', '对/p', '我/r', '很好/l', '，/w', '我/r', '也/d', '很/d', '喜欢/v', '他/r', '。/w', '一直/d', '以来/f', '我/r', '都/d', '以/p', '有/v', '一个/m', '这样/r', '的/u', '姑姑/n', '而/c', '感到/v', '荣幸/a', '，/w', '因为/p', '她/r', '和/c', '我/r', '的/u', '父亲/n', '都/d', '是/v', '从事/v', '文学/n', '的/u', '，/w', '我/r', '觉得/v', '很/d', '了不起/a', '。/w', '她/r', '的/u', '病痛/n', '让/v', '她/r', '很/d', '痛苦/a', '，/w', '但是/c', '姑姑/n', '却/d', '很/d', '坚强/a', '。/w', '现在/t', '离开/v', '对/p', '她/r', '来说/v', '也许/d', '是/v', '一种/m', '解脱/v', '，/w', '我/r', '相信/v', '在/p', '另外/r', '一个/m', '国度/n', '或者/c', '世界/n', '，/w', '姑姑/n', '一定/d', '得到/v', '了/u', '永恒/z', '！/w', '陈村/ns', '：/w', '她/r', '的/u', '一生/n', '都/d', '是/v', '坎坷/a', '的/u', '陆星儿/nr', '平时/t', '是/v', '一个/m', '很/d', '低调/a', '的/u', '人/n', '，/w', '从不/d', '炒作/v', '。/w', '在/p', '工作/vn', '上/f', '，/w', '她/r', '却/d', '特别/a', '的/u', '刻苦/a', '、/w', '勤劳/a', '。/w', '回想/v', '她/r', '的/u', '一生/n', '，/w', '是/v', '那么/r', '的/u', '不/d', '顺利/a', '。/w', '她/r', '从/p', '年轻/a', '时/Ng', '下乡/v', '到/v', '北大荒/ns', '，/w', '到/p', '后来/t', '离婚/v', '一个/m', '人/n', '带着/v', '儿子/n', '生活/vn', '，/w', '再/d', '到/v', '生病/v', '都/d', '是/v', '坎坎坷坷/z', '的/u', '，/w', '我们/r', '这些/r', '朋友/n', '在/p', '心里/s', '都/d', '很/d', '为/p', '她/r', '难过/a', '。/w', '她/r', '的/u', '儿子/n', '叫/v', '陈厦/nr', '，/w', '为什么/r', '呢/y', '？/w', '那/r', '是因为/v', '，/w', '当年/t', '她/r', '怀着/v', '孩子/n', '的/u', '时候/n', '，/w', '大/a', '着/u', '肚子/n', '坐在/v', '她/r', '丈夫/n', '的/u', '自行车/n', '上/f', '到处/d', '奔波/v', '，/w', '就是/d', '为了/p', '找/v', '房子/n', '。/w', '他们/r', '来来回回/nz', '搬/v', '了/u', '许多/m', '次/q', '家/q', '，/w', '很长/n', '一段时间/nz', '都/d', '是/v', '处于/v', '这种/r', '颠簸/vn', '的/u', '状态/n', '，/w', '所以/c', '她/r', '就/d', '给/p', '孩子/n', '取名/v', '叫/v', '陈厦/nr', '，/w', '希望/v', '自己/r', '的/u', '下一代/n', '不会/n', '再/d', '有/v', '这样/r', '的/u', '经历/n', '。/w', '她/r', '平时/t', '很/d', '节俭/a', '，/w', '总是/d', '把/p', '经历/n', '放在/v', '了/u', '工作/vn', '上/f', '、/w', '友情/n', '上/f', '。/w', '上个/b', '月/n', '我/r', '最后/f', '一次/m', '见到/v', '她/r', '的/u', '时候/n', '，/w', '她/r', '又/d', '比/p', '以前/f', '瘦/a', '了/u', '好多/m', '。/w', '我们/r', '其实/d', '也/d', '就/d', '料想/v', '到/v', '了/u', '结局/n', '，/w', '但是/c', '这/r', '结局/n', '又/d', '不免/d', '让/v', '我们/r', '难过/a', '。/w', '陆星儿/u', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '1949年11月/t', '生于/v', '上海/ns', '。/w', '1968年前/t', '在/p', '上海/ns', '读书/v', '；/w', '1978年/t', '考入/v', '中央戏剧学院/ntu', '戏剧/n', '文学系/n', '；/w', '1982年/t', '始/Vg', '任/v', '中国儿童艺术剧院/nt', '编剧/n', '；/w', '1983年/t', '加入/v', '中国作家协会/nt', '，/w', '生前/t', '为/v', '[上海/ns', '作家/n', '协会/n]/nt', '专业/n', '作家/n', '。/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w']]
        {'陆星儿': 10, '甘丹': 1, '陆川': 2, '陆天明': 2, '陈厦': 2}
    """
    print("基于感知机序列标注的词法分析器")
    start = time.time()
    PerceptronLexicalAnalyzer = JClass("com.hankcs.hanlp.model.perceptron.PerceptronLexicalAnalyzer")
    analyzer = PerceptronLexicalAnalyzer()
    ans=[]
    for sentence in tests:
        segs=analyzer.analyze(sentence)
    # segs = analyzer.analyze(text)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("词性标注结果: ",ans)
    print("姓名列表: ",name_list)
    print("运行时间差: ",end-start)
    return ans,name_list
    # print(analyzer.analyze("上海华安工业（集团）公司董事长谭旭光和秘书胡花蕊来到美国纽约现代艺术博物馆参观"))
    # print(analyzer.analyze("微软公司於1975年由比爾·蓋茲和保羅·艾倫創立，18年啟動以智慧雲端、前端為導向的大改組。"))

    # # 任何模型总会有失误，特别是98年这种陈旧的语料库
    # print(analyzer.analyze("总统普京与特朗普通电话讨论太空探索技术公司"))
    # # 支持在线学习
    # analyzer.learn("与/c 特朗普/nr 通/v 电话/n 讨论/v [太空/s 探索/vn 技术/n 公司/n]/nt")
    # # 学习到新知识
    # print(analyzer.analyze("总统普京与特朗普通电话讨论太空探索技术公司"))
    # # 还可以举一反三
    # print(analyzer.analyze("主席和特朗普通电话"))
    #
    # # 知识的泛化不是死板的规则，而是比较灵活的统计信息
    # print(analyzer.analyze("我在浙江金华出生"))
    # analyzer.learn("在/p 浙江/ns 金华/ns 出生/v")
    # print(analyzer.analyze("我在四川金华出生，我的名字叫金华"))

    # 请用户按需执行对空格制表符等的预处理，只有你最清楚自己的文本中都有些什么奇怪的东西
    # print(analyzer.analyze("空格 \t\n\r\f&nbsp;统统都不要"
    #     .replace("\\s+", "")    # 去除所有空白符
    #     .replace("&nbsp;", "")  # 如果一些文本中含有html控制符
    # ))

def demo_CRF_lexical_analyzer(tests):
    """ CRF词法分析器
    """
    print("CRF词法分析器")
    start=time.time()
    CRFLexicalAnalyzer = JClass("com.hankcs.hanlp.model.crf.CRFLexicalAnalyzer")
    analyzer = CRFLexicalAnalyzer()
    ans=[]
    for sentence in tests:
        segs=analyzer.analyze(sentence)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("词性标注结果: ", ans)
    print("姓名列表: ", name_list)
    print("运行时间差: ", end - start)
    return ans, name_list

def demo_NLP_segment(tests):
    """ NLP分词，更精准的中文分词、词性标注与命名实体识别
        标注集请查阅 https://github.com/hankcs/HanLP/blob/master/data/dictionary/other/TagPKU98.csv
        或者干脆调用 Sentence#translateLabels() 转为中文
      """
    print("NLP分词")
    start = time.time()
    NLPTokenizer = JClass("com.hankcs.hanlp.tokenizer.NLPTokenizer")
    ans = []
    for sentence in tests:
        segs = NLPTokenizer.analyze(sentence)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("词性标注结果: ", ans)
    print("姓名列表: ", name_list)
    print("运行时间差: ", end - start)
    return ans, name_list
    # print(NLPTokenizer.segment(text))  # “正确”是副形词。
    # # 注意观察下面两个“希望”的词性、两个“晚霞”的词性
    # print(NLPTokenizer.analyze(text).translateLabels())
    # print(NLPTokenizer.analyze(text))
def demo_NShort_segment(sentences):
    """ N最短路径分词，该分词器比最短路分词器慢，但是效果稍微好一些，对命名实体识别能力更强
    N-最短分词：[今天/t, ，/w, 刘志军/nr, 案/ng, 的/ude1, 关键/n, 人物/n, ,/w, 山西/ns,
        女/b, 商人/nnt, 丁书苗/nr, 在/p, 市/n, 二/m, 中/f, 院/n, 出庭/vi, 受审/vi, 。/w]
    最短路分词：[今天/t, ，/w, 刘志军/nr, 案/ng, 的/ude1, 关键/n, 人物/n, ,/w, 山西/ns,
        女/b, 商人/nnt, 丁书苗/nr, 在/p, 市/n, 二/m, 中/f, 院/n, 出庭/vi, 受审/vi, 。/w]
    N-最短分词：[江西省监狱管理局/nt, 与/cc, 中国/ns, 太平洋/ns, 财产/n, 保险/n, 股份/n,
        有限公司/nis, 南昌/ns, 中心支公司/nt, 保险/n, 合同/n, 纠纷案/nz]
    最短路分词：[江西省监狱管理局/nt, 与/cc, 中国/ns, 太平洋/ns, 财产/n, 保险/n, 股份/n,
        有限公司/nis, 南昌/ns, 中心支公司/nt, 保险/n, 合同/n, 纠纷案/nz]
    N-最短分词：[新北商贸有限公司/nt]
    最短路分词：[新北商贸有限公司/nt]
    """
    NShortSegment = JClass("com.hankcs.hanlp.seg.NShort.NShortSegment")
    Segment = JClass("com.hankcs.hanlp.seg.Segment")
    ViterbiSegment = JClass("com.hankcs.hanlp.seg.Viterbi.ViterbiSegment")

    nshort_segment = NShortSegment().enableCustomDictionary(False).enablePlaceRecognize(
        True).enableOrganizationRecognize(True)
    shortest_segment = ViterbiSegment().enableCustomDictionary(
        False).enablePlaceRecognize(True).enableOrganizationRecognize(True)

    for sentence in sentences:
        print("N-最短分词：{} \n最短路分词：{}".format(
            nshort_segment.seg(sentence), shortest_segment.seg(sentence)))

def demo_chinese_name_recognition(sentences):
    """ 人名识别
    """
    # Segment = JClass("com.hankcs.hanlp.seg.Segment")
    # Term = JClass("com.hankcs.hanlp.seg.common.Term")
    print("人名识别")
    start = time.time()
    segment = HanLP.newSegment().enableNameRecognize(True)\
                                .enableJapaneseNameRecognize(True) \
                                .enableTranslatedNameRecognize(True)

    ans=[]
    for sentence in sentences:
        segs = segment.seg(sentence)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("人名识别结果: ", ans)
    print("姓名列表: ", name_list)
    print("运行时间差: ", end - start)
    return ans, name_list
def demo_high_speed_segment(sentences):
    """ 演示极速分词，基于DoubleArrayTrie实现的词典正向最长分词，适用于“高吞吐量”“精度一般”的场合
    [江西, 鄱阳湖, 干枯, ，, 中国, 最大, 淡水湖, 变成, 大草原]
    SpeedTokenizer分词速度：1253607.32字每秒
    """
    print("极速分词，基于DoubleArrayTrie实现的词典正向最长分词，适用于“高吞吐量”“精度一般”的场合")
    start = time.time()
    SpeedTokenizer = JClass("com.hankcs.hanlp.tokenizer.SpeedTokenizer")
    # JClass("com.hankcs.hanlp.HanLP$Config").ShowTermNature = False
    ans = []
    for sentence in sentences:
        segs=SpeedTokenizer.segment(sentence)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("极速分词结果: ", ans)
    print("姓名列表: ", name_list)
    print("运行时间差: ", end - start)
    return ans, name_list
    # pressure = 1000000
    # for i in range(pressure):
    #     SpeedTokenizer.segment(text)
    # cost_time = time.time() - start
    # print("SpeedTokenizer分词速度：%.2f字每秒" % (len(text) * pressure / cost_time))
def demo_pos_tagging(sentences):
    """ 词性标注
    未标注： [教授/nnt, 正在/d, 教授/nnt, 自然语言处理/nz, 课程/n]
    标注后： [教授/nnt, 正在/d, 教授/v, 自然语言处理/nz, 课程/n]
    """
    print("词性标注")
    start = time.time()
    # Segment = JClass("com.hankcs.hanlp.seg.Segment")
    ans = []
    for sentence in sentences:
        segs=HanLP.segment(sentence)
        arr = str(segs).split(" ")
        ans.append(arr)
    ner = ['nr', 'nrf', 'nrj']
    name_list = {}
    for a in ans[0]:
        x = a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]] = 1
            else:
                name_list[x[0]] += 1
    end = time.time()
    print("极速分词结果: ", ans)
    print("姓名列表: ", name_list)
    print("运行时间差: ", end - start)
    return ans, name_list
    # Segment = JClass("com.hankcs.hanlp.seg.Segment")
    # segment = HanLP.newSegment()
    #
    # print("未标注：", segment.seg(text))
    # segment.enablePartOfSpeechTagging(True)
    # print("标注后：", segment.seg(text))
# 第三步，定义一个函数，从得到的结果中，根据词性获取指定词性的词：
def get_result(arr):
    name_list = []
    ner = ['nr','nrf']
    for x in arr:
        temp = x.split("/")
        if temp[1] in ner:
            if temp[0] not in name_list:
                name_list.append(temp[0])
    return name_list
def name(arr):
    ner = ['NR','NRF','NRJ']
    name_list={}
    for x in arr[0]:
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]]=1

            else:
                name_list[x[0]] += 1
    return  name_list


def name(arr):
    ner = ['NR','NRF','NRJ']
    ner = ['nr','nrf','nrj']

    name_list={}
    for a in arr[0]:
        x=a.split('/')
        if x[1] in ner:
            if x[0] not in name_list:
                name_list[x[0]]=1
            else:
                name_list[x[0]] += 1
    return  name_list
if __name__ == '__main__':
    # 基于感知机序列标注的词法分析器
    """
    [['陆星儿/nr', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w', '陆星儿/u', '最让人/n', '敬佩/v', '的/u', '是/v', '毅力/n', '。/w', '本报讯/y', '（/w', '记者/n', '甘丹/nrf', '）/w', '9月4日/t', '晚/Tg', '8时30分/t', '，/w', '著名/a', '女/b', '作家/n', '陆星儿/nr', '因/p', '癌症/n', '医治无效/nz', '，/w', '在/p', '上海/ns', '去世/v', '，/w', '享年/n', '55/m', '岁/q', '。/w', '记者/n', '了解到/v', '，/w', '陆星儿/nr', '的/u', '病情/n', '一直/d', '就/d', '非常/d', '严重/a', '。/w', '在/p', '经过/p', '第二次/m', '手术/v', '以后/f', '，/w', '癌症/n', '细胞/n', '甚至/d', '已经/d', '扩散/v', '到/v', '了/u', '全身/n', '很多/m', '器官/n', '。/w', '然而/c', '她/r', '并不/d', '太/d', '愿意/v', '大家/r', '过多/d', '地/u', '提到/v', '她/r', '的/u', '病情/n', '，/w', '她/r', '总是/d', '不断/d', '地/u', '鼓励/v', '自己/r', '，/w', '希望/v', '自己/r', '能/v', '坚强/a', '地/u', '活/v', '下去/v', '。/w', '陆星儿/nr', '在/p', '生病/vn', '期间/f', '创作/v', '了/u', '长篇小说/l', '《/w', '痛/a', '》/w', '、/w', '以及/c', '长篇/b', '散文/n', '《/w', '用力/v', '呼吸/v', '———/w', '陆星儿/nr', '生命/n', '日记/n', '》/w', '，/w', '这/r', '对于/p', '一个/m', '身患/v', '癌症/n', '的/u', '人/n', '来说/u', '是/v', '件/q', '极其/d', '不/d', '容易/a', '的/u', '事情/n', '。/w', '因/p', '《/w', '寻/v', '枪/n', '》/w', '而出名/i', '的/u', '导演/n', '陆川/nr', '是/v', '陆星儿/nr', '的/u', '侄子/n', '，/w', '他/r', '非常/d', '伤心/a', '，/w', '并/c', '告诉/v', '记者/n', '他/r', '父亲/n', '、/w', '陆星儿/nr', '的/u', '哥哥/n', '著名作家/n', '陆天明/nr', '更为/d', '悲伤/a', '，/w', '已经/d', '飞赴/v', '上海/ns', '。/w', '作家/n', '陈村/ns', '在/p', '接受/v', '记者/n', '采访/vn', '时说/n', '：/w', '“/w', '她/r', '在/p', '生命/n', '的/u', '最后/f', '，/w', '有/v', '儿子/n', '和/c', '许多/m', '朋友/n', '陪/v', '在/p', '她/r', '的/u', '身边/s', '，/w', '也许/d', '还算/v', '一/m', '种/q', '安慰/an', '吧/y', '。/w', '”/w', '亲友/n', '追忆/v', ']/w', '陆川/nr', '：/w', '有/v', '这样/r', '的/u', '姑姑/n', '我/r', '很/d', '荣幸/a', '在/p', '明白/v', '记者/n', '采访/vn', '目的/n', '后/f', '，/w', '陆川/ns', '沉默/a', '了/u', '好几/m', '秒/q', '。/w', '然后/c', '他/r', '说/v', '：/w', '“/w', '我/r', '真的/l', '非常/d', '伤心/a', '。/w', '”/w', '昨天晚上/nz', '做完/v', '了/u', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '试/v', '放到/v', '电影/n', '结尾/n', '时/Ng', '，/w', '接到/v', '了/u', '父亲/n', '（/w', '陆天明/nr', '）/w', '的/u', '电话/n', '，/w', '他/r', '告诉/v', '我/r', '星儿/nz', '姑姑/n', '去世/v', '了/y', '，/w', '真的/z', '非常/d', '伤心/a', '。/w', '我/r', '本来/d', '应该/v', '去/v', '上海/ns', '的/u', '，/w', '但/c', '现在/t', '正/d', '赶/v', '着/u', '做/v', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '离不开/v', '。/w', '我/r', '父母/n', '今天/t', '早上/t', '已经/d', '飞回/v', '上海/ns', '，/w', '我/r', '随后/d', '再/d', '过去/v', '。/w', '姑姑/n', '对/p', '我/r', '很好/l', '，/w', '我/r', '也/d', '很/d', '喜欢/v', '他/r', '。/w', '一直/d', '以来/f', '我/r', '都/d', '以/p', '有/v', '一个/m', '这样/r', '的/u', '姑姑/n', '而/c', '感到/v', '荣幸/a', '，/w', '因为/p', '她/r', '和/c', '我/r', '的/u', '父亲/n', '都/d', '是/v', '从事/v', '文学/n', '的/u', '，/w', '我/r', '觉得/v', '很/d', '了不起/a', '。/w', '她/r', '的/u', '病痛/n', '让/v', '她/r', '很/d', '痛苦/a', '，/w', '但是/c', '姑姑/n', '却/d', '很/d', '坚强/a', '。/w', '现在/t', '离开/v', '对/p', '她/r', '来说/v', '也许/d', '是/v', '一种/m', '解脱/v', '，/w', '我/r', '相信/v', '在/p', '另外/r', '一个/m', '国度/n', '或者/c', '世界/n', '，/w', '姑姑/n', '一定/d', '得到/v', '了/u', '永恒/z', '！/w', '陈村/ns', '：/w', '她/r', '的/u', '一生/n', '都/d', '是/v', '坎坷/a', '的/u', '陆星儿/nr', '平时/t', '是/v', '一个/m', '很/d', '低调/a', '的/u', '人/n', '，/w', '从不/d', '炒作/v', '。/w', '在/p', '工作/vn', '上/f', '，/w', '她/r', '却/d', '特别/a', '的/u', '刻苦/a', '、/w', '勤劳/a', '。/w', '回想/v', '她/r', '的/u', '一生/n', '，/w', '是/v', '那么/r', '的/u', '不/d', '顺利/a', '。/w', '她/r', '从/p', '年轻/a', '时/Ng', '下乡/v', '到/v', '北大荒/ns', '，/w', '到/p', '后来/t', '离婚/v', '一个/m', '人/n', '带着/v', '儿子/n', '生活/vn', '，/w', '再/d', '到/v', '生病/v', '都/d', '是/v', '坎坎坷坷/z', '的/u', '，/w', '我们/r', '这些/r', '朋友/n', '在/p', '心里/s', '都/d', '很/d', '为/p', '她/r', '难过/a', '。/w', '她/r', '的/u', '儿子/n', '叫/v', '陈厦/nr', '，/w', '为什么/r', '呢/y', '？/w', '那/r', '是因为/v', '，/w', '当年/t', '她/r', '怀着/v', '孩子/n', '的/u', '时候/n', '，/w', '大/a', '着/u', '肚子/n', '坐在/v', '她/r', '丈夫/n', '的/u', '自行车/n', '上/f', '到处/d', '奔波/v', '，/w', '就是/d', '为了/p', '找/v', '房子/n', '。/w', '他们/r', '来来回回/nz', '搬/v', '了/u', '许多/m', '次/q', '家/q', '，/w', '很长/n', '一段时间/nz', '都/d', '是/v', '处于/v', '这种/r', '颠簸/vn', '的/u', '状态/n', '，/w', '所以/c', '她/r', '就/d', '给/p', '孩子/n', '取名/v', '叫/v', '陈厦/nr', '，/w', '希望/v', '自己/r', '的/u', '下一代/n', '不会/n', '再/d', '有/v', '这样/r', '的/u', '经历/n', '。/w', '她/r', '平时/t', '很/d', '节俭/a', '，/w', '总是/d', '把/p', '经历/n', '放在/v', '了/u', '工作/vn', '上/f', '、/w', '友情/n', '上/f', '。/w', '上个/b', '月/n', '我/r', '最后/f', '一次/m', '见到/v', '她/r', '的/u', '时候/n', '，/w', '她/r', '又/d', '比/p', '以前/f', '瘦/a', '了/u', '好多/m', '。/w', '我们/r', '其实/d', '也/d', '就/d', '料想/v', '到/v', '了/u', '结局/n', '，/w', '但是/c', '这/r', '结局/n', '又/d', '不免/d', '让/v', '我们/r', '难过/a', '。/w', '陆星儿/u', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '1949年11月/t', '生于/v', '上海/ns', '。/w', '1968年前/t', '在/p', '上海/ns', '读书/v', '；/w', '1978年/t', '考入/v', '中央戏剧学院/ntu', '戏剧/n', '文学系/n', '；/w', '1982年/t', '始/Vg', '任/v', '中国儿童艺术剧院/nt', '编剧/n', '；/w', '1983年/t', '加入/v', '中国作家协会/nt', '，/w', '生前/t', '为/v', '[上海/ns', '作家/n', '协会/n]/nt', '专业/n', '作家/n', '。/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w']]
    {'陆星儿': 10, '甘丹': 1, '陆川': 2, '陆天明': 2, '陈厦': 2}
    """
    print("---"*10)
    demo_pos_tagging([texts])
    print("---"*10)
    demo_high_speed_segment([texts])
    print("---"*10)
    demo_perceptron_lexical_analyzer([texts])
    print("---"*10)
    demo_CRF_lexical_analyzer([texts])
    print("---"*10)
    demo_NLP_segment([texts])
    print("---"*10)
    demo_chinese_name_recognition([texts])
    print("---"*10)



    # demo_NLP_segment()

# 结果
"""
------------------------------
词性标注
极速分词结果:  [['[陆/m,', '星儿/nz,', '简介/n,', '陆/m,', '星儿/nz,', '，/w,', '祖籍/n,', '江苏/ns,', '海门/ns,', '，/w,', '出版/v,', '长篇小说/n,', '五/m,', '部/q,', '、/w,', '散文集/n,', '7/m,', '部/q,', '、/w,', '中/f,', '短篇小说/n,', '集/q,', '10/m,', '部/q,', '、/w,', '影视剧/n,', '多/a,', '部/q,', '。/w,', '陆/m,', '星儿/nz,', '最让人/n,', '敬佩/v,', '的/ude1,', '是/vshi,', '毅力/n,', '。/w,', '本报讯/nz,', '（/w,', '记者/nnt,', '甘丹/nrf,', '）/w,', '9月/t,', '4/m,', '日/b,', '晚/tg,', '8/m,', '时/qt,', '30/m,', '分/qt,', '，/w,', '著名/a,', '女作家/nnd,', '陆/m,', '星儿/nz,', '因/p,', '癌症/n,', '医治无效/nz,', '，/w,', '在/p,', '上海/ns,', '去世/vi,', '，/w,', '享年/n,', '55/m,', '岁/qt,', '。/w,', '记者/nnt,', '了解到/v,', '，/w,', '陆/m,', '星儿/nz,', '的/ude1,', '病情/n,', '一直/d,', '就/d,', '非常/d,', '严重/a,', '。/w,', '在/p,', '经过/p,', '第二/mq,', '次/qv,', '手术/n,', '以后/f,', '，/w,', '癌症/n,', '细胞/n,', '甚至/d,', '已经/d,', '扩散/v,', '到/v,', '了/ule,', '全身/n,', '很多/m,', '器官/n,', '。/w,', '然而/c,', '她/rr,', '并不/d,', '太/d,', '愿意/v,', '大家/rr,', '过多/d,', '地/ude2,', '提到/v,', '她/rr,', '的/ude1,', '病情/n,', '，/w,', '她/rr,', '总是/d,', '不断/d,', '地/ude2,', '鼓励/v,', '自己/rr,', '，/w,', '希望/v,', '自己/rr,', '能/v,', '坚强/a,', '地/ude2,', '活下去/v,', '。/w,', '陆/m,', '星儿/nz,', '在/p,', '生病/vi,', '期间/f,', '创作/vn,', '了/ule,', '长篇小说/n,', '《/w,', '痛/a,', '》/w,', '、/w,', '以及/cc,', '长篇/b,', '散文/n,', '《/w,', '用力/ad,', '呼吸/v,', '———/w,', '陆/m,', '星儿/nz,', '生命/n,', '日记/n,', '》/w,', '，/w,', '这/rzv,', '对于/p,', '一个/mq,', '身患/v,', '癌症/n,', '的/ude1,', '人/n,', '来说/uls,', '是/vshi,', '件/q,', '极其/d,', '不/d,', '容易/ad,', '的/ude1,', '事情/n,', '。/w,', '因/p,', '《/w,', '寻枪/nz,', '》/w,', '而出名/i,', '的/ude1,', '导演/nnt,', '陆川/ns,', '是/vshi,', '陆/m,', '星儿/nz,', '的/ude1,', '侄子/n,', '，/w,', '他/rr,', '非常/d,', '伤心/a,', '，/w,', '并/cc,', '告诉/v,', '记者/nnt,', '他/rr,', '父亲/n,', '、/w,', '陆/m,', '星儿/nz,', '的/ude1,', '哥哥/n,', '著名作家/n,', '陆天明/nr,', '更为/d,', '悲伤/a,', '，/w,', '已经/d,', '飞赴/v,', '上海/ns,', '。/w,', '作家/nnt,', '陈村/ns,', '在/p,', '接受/v,', '记者/nnt,', '采访/v,', '时说/n,', '：/w,', '“/w,', '她/rr,', '在/p,', '生命/n,', '的/ude1,', '最后/f,', '，/w,', '有/vyou,', '儿子/n,', '和/cc,', '许多/m,', '朋友/n,', '陪/v,', '在/p,', '她/rr,', '的/ude1,', '身边/s,', '，/w,', '也许/d,', '还算/v,', '一/m,', '种/q,', '安慰/v,', '吧/y,', '。/w,', '”/w,', '亲友/n,', '追忆/v,', ']/w,', '陆川/ns,', '：/w,', '有/vyou,', '这样/rzv,', '的/ude1,', '姑姑/n,', '我/rr,', '很/d,', '荣幸/a,', '在/p,', '明白/v,', '记者/nnt,', '采访/v,', '目的/n,', '后/f,', '，/w,', '陆川/ns,', '沉默/a,', '了/ule,', '好几/mq,', '秒/qt,', '。/w,', '然后/c,', '他/rr,', '说/v,', '：/w,', '“/w,', '我/rr,', '真的/d,', '非常/d,', '伤心/a,', '。/w,', '”/w,', '昨天晚上/nz,', '做完/v,', '了/ule,', '《/w,', '可可西里/nz,', '》/w,', '的/ude1,', '拷贝/n,', '，/w,', '试/v,', '放到/v,', '电影/n,', '结尾/n,', '时/qt,', '，/w,', '接到/v,', '了/ule,', '父亲/n,', '（/w,', '陆天明/nr,', '）/w,', '的/ude1,', '电话/n,', '，/w,', '他/rr,', '告诉/v,', '我/rr,', '星儿/nz,', '姑姑/n,', '去世/vi,', '了/ule,', '，/w,', '真的/d,', '非常/d,', '伤心/a,', '。/w,', '我/rr,', '本来/d,', '应该/v,', '去/vf,', '上海/ns,', '的/ude1,', '，/w,', '但/c,', '现在/t,', '正/d,', '赶着/nz,', '做/v,', '《/w,', '可可西里/nz,', '》/w,', '的/ude1,', '拷贝/n,', '，/w,', '离不开/v,', '。/w,', '我/rr,', '父母/n,', '今天/t,', '早上/t,', '已经/d,', '飞回/vf,', '上海/ns,', '，/w,', '我/rr,', '随后/d,', '再/d,', '过去/vf,', '。/w,', '姑姑/n,', '对/p,', '我/rr,', '很好/ad,', '，/w,', '我/rr,', '也/d,', '很/d,', '喜欢/vi,', '他/rr,', '。/w,', '一直/d,', '以来/f,', '我/rr,', '都以/nr,', '有/vyou,', '一个/mq,', '这样/rzv,', '的/ude1,', '姑姑/n,', '而/cc,', '感到/v,', '荣幸/a,', '，/w,', '因为/c,', '她/rr,', '和/cc,', '我/rr,', '的/ude1,', '父亲/n,', '都/d,', '是/vshi,', '从事/vi,', '文学/n,', '的/ude1,', '，/w,', '我/rr,', '觉得/v,', '很/d,', '了不起/a,', '。/w,', '她/rr,', '的/ude1,', '病痛/n,', '让/v,', '她/rr,', '很/d,', '痛苦/an,', '，/w,', '但是/c,', '姑姑/n,', '却/d,', '很/d,', '坚强/a,', '。/w,', '现在/t,', '离开/v,', '对/p,', '她/rr,', '来说/uls,', '也许/d,', '是/vshi,', '一/m,', '种/q,', '解脱/v,', '，/w,', '我/rr,', '相信/v,', '在/p,', '另外/c,', '一个/mq,', '国度/n,', '或者/c,', '世界/n,', '，/w,', '姑姑/n,', '一定/b,', '得到/v,', '了/ule,', '永恒/z,', '！/w,', '陈村/ns,', '：/w,', '她/rr,', '的/ude1,', '一生/n,', '都/d,', '是/vshi,', '坎坷/an,', '的/ude1,', '陆/m,', '星儿/nz,', '平时/t,', '是/vshi,', '一个/mq,', '很/d,', '低调/n,', '的/ude1,', '人/n,', '，/w,', '从不/d,', '炒作/v,', '。/w,', '在/p,', '工作/vn,', '上/f,', '，/w,', '她/rr,', '却/d,', '特别/d,', '的/ude1,', '刻苦/ad,', '、/w,', '勤劳/a,', '。/w,', '回想/v,', '她/rr,', '的/ude1,', '一生/n,', '，/w,', '是/vshi,', '那么/c,', '的/ude1,', '不/d,', '顺利/ad,', '。/w,', '她/rr,', '从/p,', '年轻时/nz,', '下乡/vi,', '到/v,', '北大荒/ns,', '，/w,', '到/v,', '后来/t,', '离婚/vi,', '一个/mq,', '人/n,', '带着/vn,', '儿子/n,', '生活/vn,', '，/w,', '再/d,', '到/v,', '生病/vi,', '都/d,', '是/vshi,', '坎坎坷坷/z,', '的/ude1,', '，/w,', '我们/rr,', '这些/rz,', '朋友/n,', '在/p,', '心里/s,', '都/d,', '很/d,', '为/p,', '她/rr,', '难过/a,', '。/w,', '她/rr,', '的/ude1,', '儿子/n,', '叫/vi,', '陈厦/nr,', '，/w,', '为什么/ryv,', '呢/y,', '？/w,', '那/rzv,', '是因为/c,', '，/w,', '当年/t,', '她/rr,', '怀着/v,', '孩子/n,', '的/ude1,', '时候/n,', '，/w,', '大/a,', '着/uzhe,', '肚子/n,', '坐在/v,', '她/rr,', '丈夫/n,', '的/ude1,', '自行车/n,', '上/f,', '到处/d,', '奔波/vi,', '，/w,', '就是/v,', '为了/p,', '找/v,', '房子/n,', '。/w,', '他们/rr,', '来来回回/nz,', '搬/v,', '了/ule,', '许多/m,', '次/qv,', '家/q,', '，/w,', '很长/d,', '一段时间/nz,', '都/d,', '是/vshi,', '处于/v,', '这种/r,', '颠簸/vi,', '的/ude1,', '状态/n,', '，/w,', '所以/c,', '她/rr,', '就/d,', '给/p,', '孩子/n,', '取名/v,', '叫/vi,', '陈厦/nr,', '，/w,', '希望/v,', '自己/rr,', '的/ude1,', '下一代/n,', '不会/v,', '再/d,', '有/vyou,', '这样/rzv,', '的/ude1,', '经历/n,', '。/w,', '她/rr,', '平时/t,', '很/d,', '节俭/a,', '，/w,', '总是/d,', '把/pba,', '经历/n,', '放在/v,', '了/ule,', '工作/vn,', '上/f,', '、/w,', '友情/n,', '上/f,', '。/w,', '上个月/t,', '我/rr,', '最后/f,', '一/m,', '次/qv,', '见到/v,', '她/rr,', '的/ude1,', '时候/n,', '，/w,', '她/rr,', '又/d,', '比/p,', '以前/f,', '瘦/a,', '了/ule,', '好多/mq,', '。/w,', '我们/rr,', '其实/d,', '也/d,', '就/d,', '料想到/nz,', '了/ule,', '结局/n,', '，/w,', '但是/c,', '这/rzv,', '结局/n,', '又/d,', '不免/d,', '让/v,', '我们/rr,', '难过/a,', '。/w,', '陆/m,', '星儿/nz,', '简介/n,', '陆/m,', '星儿/nz,', '，/w,', '祖籍/n,', '江苏/ns,', '海门/ns,', '，/w,', '1949/m,', '年/qt,', '11月/t,', '生于/v,', '上海/ns,', '。/w,', '1968/m,', '年前/t,', '在/p,', '上海/ns,', '读书/vi,', '；/w,', '1978/m,', '年/qt,', '考入/v,', '中央戏剧学院/ntu,', '戏剧/n,', '文学系/nit,', '；/w,', '1982/m,', '年/qt,', '始/vg,', '任/v,', '中国儿童艺术剧院/nt,', '编剧/nnt,', '；/w,', '1983/m,', '年/qt,', '加入/v,', '中国作家协会/nt,', '，/w,', '生前/t,', '为/p,', '上海/ns,', '作家/nnt,', '协会/nis,', '专业/n,', '作家/nnt,', '。/w,', '出版/v,', '长篇小说/n,', '五/m,', '部/q,', '、/w,', '散文集/n,', '7/m,', '部/q,', '、/w,', '中/f,', '短篇小说/n,', '集/q,', '10/m,', '部/q,', '、/w,', '影视剧/n,', '多/a,', '部/q,', '。/w]']]
姓名列表:  {}
运行时间差:  0.3768918514251709
------------------------------
极速分词，基于DoubleArrayTrie实现的词典正向最长分词，适用于“高吞吐量”“精度一般”的场合
极速分词结果:  [['[陆/null,', '星/null,', '儿/null,', '简介/null,', '陆/null,', '星/null,', '儿/null,', '，/null,', '祖籍/null,', '江苏/null,', '海门/null,', '，/null,', '出版/null,', '长篇小说/null,', '五/null,', '部/null,', '、/null,', '散文集/null,', '7/null,', '部/null,', '、/null,', '中/null,', '短篇小说/null,', '集/null,', '1/null,', '0/null,', '部/null,', '、/null,', '影视剧/null,', '多/null,', '部/null,', '。/null,', '陆/null,', '星/null,', '儿/null,', '最/null,', '让/null,', '人/null,', '敬佩/null,', '的/null,', '是/null,', '毅力/null,', '。/null,', '本报讯/null,', '（/null,', '记者/null,', '甘/null,', '丹/null,', '）/null,', '9月/null,', '4/null,', '日/null,', '晚/null,', '8/null,', '时/null,', '3/null,', '0/null,', '分/null,', '，/null,', '著名/null,', '女作家/null,', '陆/null,', '星/null,', '儿/null,', '因/null,', '癌症/null,', '医治/null,', '无效/null,', '，/null,', '在/null,', '上海/null,', '去世/null,', '，/null,', '享年/null,', '5/null,', '5/null,', '岁/null,', '。/null,', '记者/null,', '了解到/null,', '，/null,', '陆/null,', '星/null,', '儿/null,', '的/null,', '病情/null,', '一直/null,', '就/null,', '非常/null,', '严重/null,', '。/null,', '在/null,', '经过/null,', '第二/null,', '次/null,', '手术/null,', '以后/null,', '，/null,', '癌症/null,', '细胞/null,', '甚至/null,', '已经/null,', '扩散/null,', '到/null,', '了/null,', '全身/null,', '很多/null,', '器官/null,', '。/null,', '然而/null,', '她/null,', '并不/null,', '太/null,', '愿意/null,', '大家/null,', '过多/null,', '地/null,', '提到/null,', '她/null,', '的/null,', '病情/null,', '，/null,', '她/null,', '总是/null,', '不断/null,', '地/null,', '鼓励/null,', '自己/null,', '，/null,', '希望/null,', '自己/null,', '能/null,', '坚强/null,', '地/null,', '活下去/null,', '。/null,', '陆/null,', '星/null,', '儿/null,', '在/null,', '生病/null,', '期间/null,', '创作/null,', '了/null,', '长篇小说/null,', '《/null,', '痛/null,', '》/null,', '、/null,', '以及/null,', '长篇/null,', '散文/null,', '《/null,', '用力/null,', '呼吸/null,', '———/null,', '陆/null,', '星/null,', '儿/null,', '生命/null,', '日记/null,', '》/null,', '，/null,', '这/null,', '对于/null,', '一个/null,', '身患/null,', '癌症/null,', '的/null,', '人/null,', '来说/null,', '是/null,', '件/null,', '极其/null,', '不容/null,', '易/null,', '的/null,', '事情/null,', '。/null,', '因/null,', '《/null,', '寻枪/null,', '》/null,', '而/null,', '出名/null,', '的/null,', '导演/null,', '陆川/null,', '是/null,', '陆/null,', '星/null,', '儿/null,', '的/null,', '侄子/null,', '，/null,', '他/null,', '非常/null,', '伤心/null,', '，/null,', '并/null,', '告诉/null,', '记者/null,', '他/null,', '父亲/null,', '、/null,', '陆/null,', '星/null,', '儿/null,', '的哥/null,', '哥/null,', '著名/null,', '作家/null,', '陆/null,', '天明/null,', '更为/null,', '悲伤/null,', '，/null,', '已经/null,', '飞赴/null,', '上海/null,', '。/null,', '作家/null,', '陈/null,', '村/null,', '在/null,', '接受/null,', '记者/null,', '采访/null,', '时/null,', '说/null,', '：/null,', '“/null,', '她/null,', '在/null,', '生命/null,', '的/null,', '最后/null,', '，/null,', '有/null,', '儿子/null,', '和/null,', '许多/null,', '朋友/null,', '陪/null,', '在/null,', '她/null,', '的/null,', '身边/null,', '，/null,', '也许/null,', '还/null,', '算/null,', '一/null,', '种/null,', '安慰/null,', '吧/null,', '。/null,', '”/null,', '亲友/null,', '追忆/null,', ']/null,', '陆川/null,', '：/null,', '有/null,', '这样/null,', '的/null,', '姑姑/null,', '我/null,', '很/null,', '荣幸/null,', '在/null,', '明白/null,', '记者/null,', '采访/null,', '目的/null,', '后/null,', '，/null,', '陆川/null,', '沉默/null,', '了/null,', '好几/null,', '秒/null,', '。/null,', '然后/null,', '他/null,', '说/null,', '：/null,', '“/null,', '我/null,', '真的/null,', '非常/null,', '伤心/null,', '。/null,', '”/null,', '昨天/null,', '晚上/null,', '做完/null,', '了/null,', '《/null,', '可可西/null,', '里/null,', '》/null,', '的/null,', '拷贝/null,', '，/null,', '试/null,', '放到/null,', '电影/null,', '结尾/null,', '时/null,', '，/null,', '接到/null,', '了/null,', '父亲/null,', '（/null,', '陆/null,', '天明/null,', '）/null,', '的/null,', '电话/null,', '，/null,', '他/null,', '告诉/null,', '我/null,', '星/null,', '儿/null,', '姑姑/null,', '去世/null,', '了/null,', '，/null,', '真的/null,', '非常/null,', '伤心/null,', '。/null,', '我/null,', '本来/null,', '应该/null,', '去/null,', '上海/null,', '的/null,', '，/null,', '但/null,', '现在/null,', '正/null,', '赶着/null,', '做/null,', '《/null,', '可可西/null,', '里/null,', '》/null,', '的/null,', '拷贝/null,', '，/null,', '离不开/null,', '。/null,', '我/null,', '父母/null,', '今天/null,', '早上/null,', '已经/null,', '飞回/null,', '上海/null,', '，/null,', '我/null,', '随后/null,', '再/null,', '过去/null,', '。/null,', '姑姑/null,', '对/null,', '我/null,', '很好/null,', '，/null,', '我/null,', '也/null,', '很/null,', '喜欢/null,', '他/null,', '。/null,', '一直/null,', '以来/null,', '我/null,', '都/null,', '以/null,', '有/null,', '一个/null,', '这样/null,', '的/null,', '姑姑/null,', '而/null,', '感到/null,', '荣幸/null,', '，/null,', '因为/null,', '她/null,', '和/null,', '我/null,', '的/null,', '父亲/null,', '都/null,', '是/null,', '从事/null,', '文学/null,', '的/null,', '，/null,', '我/null,', '觉得/null,', '很/null,', '了不起/null,', '。/null,', '她/null,', '的/null,', '病痛/null,', '让/null,', '她/null,', '很/null,', '痛苦/null,', '，/null,', '但是/null,', '姑姑/null,', '却/null,', '很/null,', '坚强/null,', '。/null,', '现在/null,', '离开/null,', '对/null,', '她/null,', '来说/null,', '也许/null,', '是/null,', '一/null,', '种/null,', '解脱/null,', '，/null,', '我/null,', '相信/null,', '在/null,', '另外/null,', '一个/null,', '国度/null,', '或者/null,', '世界/null,', '，/null,', '姑姑/null,', '一定/null,', '得到/null,', '了/null,', '永恒/null,', '！/null,', '陈/null,', '村/null,', '：/null,', '她/null,', '的/null,', '一生/null,', '都/null,', '是/null,', '坎坷/null,', '的/null,', '陆/null,', '星/null,', '儿/null,', '平时/null,', '是/null,', '一个/null,', '很低/null,', '调/null,', '的/null,', '人/null,', '，/null,', '从不/null,', '炒作/null,', '。/null,', '在/null,', '工作/null,', '上/null,', '，/null,', '她/null,', '却/null,', '特别/null,', '的/null,', '刻苦/null,', '、/null,', '勤劳/null,', '。/null,', '回想/null,', '她/null,', '的/null,', '一生/null,', '，/null,', '是/null,', '那么/null,', '的/null,', '不顺/null,', '利/null,', '。/null,', '她/null,', '从/null,', '年轻时/null,', '下乡/null,', '到/null,', '北大荒/null,', '，/null,', '到/null,', '后来/null,', '离婚/null,', '一个/null,', '人/null,', '带着/null,', '儿子/null,', '生活/null,', '，/null,', '再/null,', '到/null,', '生病/null,', '都/null,', '是/null,', '坎坎/null,', '坷/null,', '坷/null,', '的/null,', '，/null,', '我们/null,', '这些/null,', '朋友/null,', '在心/null,', '里/null,', '都/null,', '很/null,', '为/null,', '她/null,', '难过/null,', '。/null,', '她/null,', '的/null,', '儿子/null,', '叫/null,', '陈/null,', '厦/null,', '，/null,', '为什么/null,', '呢/null,', '？/null,', '那/null,', '是因为/null,', '，/null,', '当年/null,', '她/null,', '怀着/null,', '孩子/null,', '的/null,', '时候/null,', '，/null,', '大/null,', '着/null,', '肚子/null,', '坐/null,', '在/null,', '她/null,', '丈夫/null,', '的/null,', '自行车/null,', '上/null,', '到处/null,', '奔波/null,', '，/null,', '就是/null,', '为了/null,', '找/null,', '房子/null,', '。/null,', '他们/null,', '来/null,', '来回/null,', '回/null,', '搬/null,', '了/null,', '许多/null,', '次/null,', '家/null,', '，/null,', '很长/null,', '一/null,', '段/null,', '时间/null,', '都/null,', '是/null,', '处于/null,', '这种/null,', '颠簸/null,', '的/null,', '状态/null,', '，/null,', '所以/null,', '她/null,', '就/null,', '给/null,', '孩子/null,', '取名/null,', '叫/null,', '陈/null,', '厦/null,', '，/null,', '希望/null,', '自己/null,', '的/null,', '下一代/null,', '不会/null,', '再有/null,', '这样/null,', '的/null,', '经历/null,', '。/null,', '她/null,', '平时/null,', '很/null,', '节俭/null,', '，/null,', '总是/null,', '把/null,', '经历/null,', '放在/null,', '了/null,', '工作/null,', '上/null,', '、/null,', '友情/null,', '上/null,', '。/null,', '上个月/null,', '我/null,', '最后/null,', '一/null,', '次/null,', '见到/null,', '她/null,', '的/null,', '时候/null,', '，/null,', '她/null,', '又/null,', '比/null,', '以前/null,', '瘦/null,', '了/null,', '好多/null,', '。/null,', '我们/null,', '其实/null,', '也/null,', '就/null,', '料想到/null,', '了结/null,', '局/null,', '，/null,', '但是/null,', '这/null,', '结局/null,', '又/null,', '不免/null,', '让/null,', '我们/null,', '难过/null,', '。/null,', '陆/null,', '星/null,', '儿/null,', '简介/null,', '陆/null,', '星/null,', '儿/null,', '，/null,', '祖籍/null,', '江苏/null,', '海门/null,', '，/null,', '1/null,', '9/null,', '4/null,', '9/null,', '年/null,', '11月/null,', '生于/null,', '上海/null,', '。/null,', '1/null,', '9/null,', '6/null,', '8/null,', '年前/null,', '在/null,', '上海/null,', '读书/null,', '；/null,', '1/null,', '9/null,', '7/null,', '8/null,', '年考/null,', '入/null,', '中央/null,', '戏剧学院/null,', '戏剧/null,', '文学系/null,', '；/null,', '1/null,', '9/null,', '8/null,', '2/null,', '年/null,', '始/null,', '任/null,', '中国/null,', '儿童/null,', '艺术剧院/null,', '编剧/null,', '；/null,', '1/null,', '9/null,', '8/null,', '3/null,', '年/null,', '加入/null,', '中国/null,', '作家协会/null,', '，/null,', '生前/null,', '为/null,', '上海/null,', '作家协会/null,', '专业/null,', '作家/null,', '。/null,', '出版/null,', '长篇小说/null,', '五/null,', '部/null,', '、/null,', '散文集/null,', '7/null,', '部/null,', '、/null,', '中/null,', '短篇小说/null,', '集/null,', '1/null,', '0/null,', '部/null,', '、/null,', '影视剧/null,', '多/null,', '部/null,', '。/null]']]
姓名列表:  {}
运行时间差:  0.01299285888671875
------------------------------
基于感知机序列标注的词法分析器
词性标注结果:  [['陆星儿/nr', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w', '陆星儿/u', '最让人/n', '敬佩/v', '的/u', '是/v', '毅力/n', '。/w', '本报讯/y', '（/w', '记者/n', '甘丹/nrf', '）/w', '9月4日/t', '晚/Tg', '8时30分/t', '，/w', '著名/a', '女/b', '作家/n', '陆星儿/nr', '因/p', '癌症/n', '医治无效/nz', '，/w', '在/p', '上海/ns', '去世/v', '，/w', '享年/n', '55/m', '岁/q', '。/w', '记者/n', '了解到/v', '，/w', '陆星儿/nr', '的/u', '病情/n', '一直/d', '就/d', '非常/d', '严重/a', '。/w', '在/p', '经过/p', '第二次/m', '手术/v', '以后/f', '，/w', '癌症/n', '细胞/n', '甚至/d', '已经/d', '扩散/v', '到/v', '了/u', '全身/n', '很多/m', '器官/n', '。/w', '然而/c', '她/r', '并不/d', '太/d', '愿意/v', '大家/r', '过多/d', '地/u', '提到/v', '她/r', '的/u', '病情/n', '，/w', '她/r', '总是/d', '不断/d', '地/u', '鼓励/v', '自己/r', '，/w', '希望/v', '自己/r', '能/v', '坚强/a', '地/u', '活/v', '下去/v', '。/w', '陆星儿/nr', '在/p', '生病/vn', '期间/f', '创作/v', '了/u', '长篇小说/l', '《/w', '痛/a', '》/w', '、/w', '以及/c', '长篇/b', '散文/n', '《/w', '用力/v', '呼吸/v', '———/w', '陆星儿/nr', '生命/n', '日记/n', '》/w', '，/w', '这/r', '对于/p', '一个/m', '身患/v', '癌症/n', '的/u', '人/n', '来说/u', '是/v', '件/q', '极其/d', '不/d', '容易/a', '的/u', '事情/n', '。/w', '因/p', '《/w', '寻/v', '枪/n', '》/w', '而出名/i', '的/u', '导演/n', '陆川/nr', '是/v', '陆星儿/nr', '的/u', '侄子/n', '，/w', '他/r', '非常/d', '伤心/a', '，/w', '并/c', '告诉/v', '记者/n', '他/r', '父亲/n', '、/w', '陆星儿/nr', '的/u', '哥哥/n', '著名作家/n', '陆天明/nr', '更为/d', '悲伤/a', '，/w', '已经/d', '飞赴/v', '上海/ns', '。/w', '作家/n', '陈村/ns', '在/p', '接受/v', '记者/n', '采访/vn', '时说/n', '：/w', '“/w', '她/r', '在/p', '生命/n', '的/u', '最后/f', '，/w', '有/v', '儿子/n', '和/c', '许多/m', '朋友/n', '陪/v', '在/p', '她/r', '的/u', '身边/s', '，/w', '也许/d', '还算/v', '一/m', '种/q', '安慰/an', '吧/y', '。/w', '”/w', '亲友/n', '追忆/v', ']/w', '陆川/nr', '：/w', '有/v', '这样/r', '的/u', '姑姑/n', '我/r', '很/d', '荣幸/a', '在/p', '明白/v', '记者/n', '采访/vn', '目的/n', '后/f', '，/w', '陆川/ns', '沉默/a', '了/u', '好几/m', '秒/q', '。/w', '然后/c', '他/r', '说/v', '：/w', '“/w', '我/r', '真的/l', '非常/d', '伤心/a', '。/w', '”/w', '昨天晚上/nz', '做完/v', '了/u', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '试/v', '放到/v', '电影/n', '结尾/n', '时/Ng', '，/w', '接到/v', '了/u', '父亲/n', '（/w', '陆天明/nr', '）/w', '的/u', '电话/n', '，/w', '他/r', '告诉/v', '我/r', '星儿/nz', '姑姑/n', '去世/v', '了/y', '，/w', '真的/z', '非常/d', '伤心/a', '。/w', '我/r', '本来/d', '应该/v', '去/v', '上海/ns', '的/u', '，/w', '但/c', '现在/t', '正/d', '赶/v', '着/u', '做/v', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '离不开/v', '。/w', '我/r', '父母/n', '今天/t', '早上/t', '已经/d', '飞回/v', '上海/ns', '，/w', '我/r', '随后/d', '再/d', '过去/v', '。/w', '姑姑/n', '对/p', '我/r', '很好/l', '，/w', '我/r', '也/d', '很/d', '喜欢/v', '他/r', '。/w', '一直/d', '以来/f', '我/r', '都/d', '以/p', '有/v', '一个/m', '这样/r', '的/u', '姑姑/n', '而/c', '感到/v', '荣幸/a', '，/w', '因为/p', '她/r', '和/c', '我/r', '的/u', '父亲/n', '都/d', '是/v', '从事/v', '文学/n', '的/u', '，/w', '我/r', '觉得/v', '很/d', '了不起/a', '。/w', '她/r', '的/u', '病痛/n', '让/v', '她/r', '很/d', '痛苦/a', '，/w', '但是/c', '姑姑/n', '却/d', '很/d', '坚强/a', '。/w', '现在/t', '离开/v', '对/p', '她/r', '来说/v', '也许/d', '是/v', '一种/m', '解脱/v', '，/w', '我/r', '相信/v', '在/p', '另外/r', '一个/m', '国度/n', '或者/c', '世界/n', '，/w', '姑姑/n', '一定/d', '得到/v', '了/u', '永恒/z', '！/w', '陈村/ns', '：/w', '她/r', '的/u', '一生/n', '都/d', '是/v', '坎坷/a', '的/u', '陆星儿/nr', '平时/t', '是/v', '一个/m', '很/d', '低调/a', '的/u', '人/n', '，/w', '从不/d', '炒作/v', '。/w', '在/p', '工作/vn', '上/f', '，/w', '她/r', '却/d', '特别/a', '的/u', '刻苦/a', '、/w', '勤劳/a', '。/w', '回想/v', '她/r', '的/u', '一生/n', '，/w', '是/v', '那么/r', '的/u', '不/d', '顺利/a', '。/w', '她/r', '从/p', '年轻/a', '时/Ng', '下乡/v', '到/v', '北大荒/ns', '，/w', '到/p', '后来/t', '离婚/v', '一个/m', '人/n', '带着/v', '儿子/n', '生活/vn', '，/w', '再/d', '到/v', '生病/v', '都/d', '是/v', '坎坎坷坷/z', '的/u', '，/w', '我们/r', '这些/r', '朋友/n', '在/p', '心里/s', '都/d', '很/d', '为/p', '她/r', '难过/a', '。/w', '她/r', '的/u', '儿子/n', '叫/v', '陈厦/nr', '，/w', '为什么/r', '呢/y', '？/w', '那/r', '是因为/v', '，/w', '当年/t', '她/r', '怀着/v', '孩子/n', '的/u', '时候/n', '，/w', '大/a', '着/u', '肚子/n', '坐在/v', '她/r', '丈夫/n', '的/u', '自行车/n', '上/f', '到处/d', '奔波/v', '，/w', '就是/d', '为了/p', '找/v', '房子/n', '。/w', '他们/r', '来来回回/nz', '搬/v', '了/u', '许多/m', '次/q', '家/q', '，/w', '很长/n', '一段时间/nz', '都/d', '是/v', '处于/v', '这种/r', '颠簸/vn', '的/u', '状态/n', '，/w', '所以/c', '她/r', '就/d', '给/p', '孩子/n', '取名/v', '叫/v', '陈厦/nr', '，/w', '希望/v', '自己/r', '的/u', '下一代/n', '不会/n', '再/d', '有/v', '这样/r', '的/u', '经历/n', '。/w', '她/r', '平时/t', '很/d', '节俭/a', '，/w', '总是/d', '把/p', '经历/n', '放在/v', '了/u', '工作/vn', '上/f', '、/w', '友情/n', '上/f', '。/w', '上个/b', '月/n', '我/r', '最后/f', '一次/m', '见到/v', '她/r', '的/u', '时候/n', '，/w', '她/r', '又/d', '比/p', '以前/f', '瘦/a', '了/u', '好多/m', '。/w', '我们/r', '其实/d', '也/d', '就/d', '料想/v', '到/v', '了/u', '结局/n', '，/w', '但是/c', '这/r', '结局/n', '又/d', '不免/d', '让/v', '我们/r', '难过/a', '。/w', '陆星儿/u', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '1949年11月/t', '生于/v', '上海/ns', '。/w', '1968年前/t', '在/p', '上海/ns', '读书/v', '；/w', '1978年/t', '考入/v', '中央戏剧学院/ntu', '戏剧/n', '文学系/n', '；/w', '1982年/t', '始/Vg', '任/v', '中国儿童艺术剧院/nt', '编剧/n', '；/w', '1983年/t', '加入/v', '中国作家协会/nt', '，/w', '生前/t', '为/v', '[上海/ns', '作家/n', '协会/n]/nt', '专业/n', '作家/n', '。/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w']]
姓名列表:  {'陆星儿': 10, '甘丹': 1, '陆川': 2, '陆天明': 2, '陈厦': 2}
运行时间差:  2.9012649059295654
------------------------------
CRF词法分析器
词性标注结果:  [['陆星儿/nr', '简介/v', '陆星儿/n', '，/w', '祖籍/n', '江苏/ns', '海门/ns', '，/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7部/m', '、/w', '中短篇小说/l', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多/m', '部/q', '。/w', '陆星儿/nr', '最让人/n', '敬佩/v', '的/u', '是/v', '毅力/n', '。/w', '本报/r', '讯/Ng', '（/w', '记者/n', '甘丹/nrf', '）/w', '9月/t', '4日/t', '晚/Tg', '8时/t', '30分/t', '，/w', '著名/a', '女作家/n', '陆星儿/n', '因/p', '癌症/n', '医治无效/nz', '，/w', '在/p', '上海/ns', '去世/v', '，/w', '享年/n', '55/m', '岁/q', '。/w', '记者/n', '了解/v', '到/v', '，/w', '陆星儿/nr', '的/u', '病情/n', '一直/d', '就/d', '非常/d', '严重/a', '。/w', '在/p', '经过/p', '第二/m', '次/q', '手术/v', '以后/f', '，/w', '癌症/n', '细胞/n', '甚至/d', '已经/d', '扩散/v', '到/v', '了/u', '全身/n', '很多/m', '器官/n', '。/w', '然而/c', '她/r', '并/d', '不/d', '太/d', '愿意/v', '大家/r', '过多/d', '地/u', '提到/v', '她/r', '的/u', '病情/n', '，/w', '她/r', '总是/d', '不断/d', '地/u', '鼓励/v', '自己/r', '，/w', '希望/v', '自己/r', '能/v', '坚强/a', '地/u', '活/v', '下去/v', '。/w', '陆星儿/nr', '在/p', '生病/n', '期间/f', '创作/v', '了/u', '长篇小说/l', '《/w', '痛/a', '》/w', '、/w', '以及/c', '长篇/b', '散文/n', '《/w', '用力/n', '呼吸/v', '———/w', '陆星儿/nr', '生命/n', '日记/n', '》/w', '，/w', '这/r', '对于/p', '一个/m', '身/Ng', '患/v', '癌症/n', '的/u', '人/n', '来说/u', '是/v', '件/q', '极其/d', '不/d', '容易/a', '的/u', '事情/n', '。/w', '因/p', '《/w', '寻枪/n', '》/w', '而出名/i', '的/u', '导演/n', '陆川/nr', '是/v', '陆星儿/n', '的/u', '侄子/n', '，/w', '他/r', '非常/d', '伤心/a', '，/w', '并/c', '告诉/v', '记者/n', '他/r', '父亲/n', '、/w', '陆星儿/nr', '的/u', '哥哥/n', '著名作家/n', '陆天明/nr', '更为/d', '悲伤/a', '，/w', '已经/d', '飞赴/v', '上海/ns', '。/w', '作家/n', '陈村/ns', '在/p', '接受/v', '记者/n', '采访/v', '时说/n', '：/w', '“/w', '她/r', '在/p', '生命/n', '的/u', '最后/f', '，/w', '有/v', '儿子/n', '和/c', '许多/m', '朋友/n', '陪/v', '在/p', '她/r', '的/u', '身边/s', '，/w', '也许/d', '还算/v', '一/m', '种/q', '安慰/a', '吧/y', '。/w', '”/w', '亲友/n', '追忆/v', ']/w', '陆川/nr', '：/w', '有/v', '这样/r', '的/u', '姑姑/n', '我/r', '很/d', '荣幸/a', '在/p', '明白/v', '记者/n', '采访/v', '目的/n', '后/f', '，/w', '陆川/nr', '沉默/a', '了/u', '好几/m', '秒/q', '。/w', '然后/c', '他/r', '说/v', '：/w', '“/w', '我/r', '真的/d', '非常/d', '伤心/a', '。/w', '”/w', '昨天晚上/nz', '做/v', '完/v', '了/u', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '试放/v', '到/v', '电影/n', '结尾/n', '时/Ng', '，/w', '接到/v', '了/u', '父亲/n', '（/w', '陆天明/nr', '）/w', '的/u', '电话/n', '，/w', '他/r', '告诉/v', '我/r', '星儿/nz', '姑姑/n', '去世/v', '了/y', '，/w', '真的/d', '非常/d', '伤心/a', '。/w', '我/r', '本来/d', '应该/v', '去/v', '上海/ns', '的/u', '，/w', '但/c', '现在/t', '正/d', '赶/v', '着/u', '做/v', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '离/v', '不开/v', '。/w', '我/r', '父母/n', '今天/t', '早上/t', '已经/d', '飞/v', '回/v', '上海/ns', '，/w', '我/r', '随后/d', '再/d', '过去/v', '。/w', '姑姑/n', '对/p', '我/r', '很/d', '好/a', '，/w', '我/r', '也/d', '很/d', '喜欢/v', '他/r', '。/w', '一直/d', '以来/f', '我/r', '都/d', '以/p', '有/v', '一个/m', '这样/r', '的/u', '姑姑/n', '而/c', '感到/v', '荣幸/an', '，/w', '因为/c', '她/r', '和/c', '我/r', '的/u', '父亲/n', '都/d', '是/v', '从事/v', '文学/n', '的/u', '，/w', '我/r', '觉得/v', '很/d', '了不起/a', '。/w', '她/r', '的/u', '病痛/n', '让/v', '她/r', '很/d', '痛苦/a', '，/w', '但是/c', '姑姑/n', '却/d', '很/d', '坚强/a', '。/w', '现在/t', '离开/v', '对/p', '她/r', '来说/u', '也许/d', '是/v', '一/m', '种/q', '解脱/vn', '，/w', '我/r', '相信/v', '在/p', '另外/r', '一个/m', '国度/n', '或者/c', '世界/n', '，/w', '姑姑/n', '一定/d', '得到/v', '了/u', '永恒/z', '！/w', '陈村/ns', '：/w', '她/r', '的/u', '一生/n', '都/d', '是/v', '坎坷/a', '的/u', '陆星儿/n', '平时/t', '是/v', '一个/m', '很/d', '低调/a', '的/u', '人/n', '，/w', '从不/d', '炒作/v', '。/w', '在/p', '工作/vn', '上/f', '，/w', '她/r', '却/d', '特别/a', '的/u', '刻苦/a', '、/w', '勤劳/a', '。/w', '回想/v', '她/r', '的/u', '一生/n', '，/w', '是/v', '那么/r', '的/u', '不/d', '顺利/a', '。/w', '她/r', '从/p', '年轻/a', '时/Ng', '下乡/v', '到/v', '北大荒/ns', '，/w', '到/p', '后来/t', '离婚/v', '一个/m', '人/n', '带/v', '着/u', '儿子/n', '生活/vn', '，/w', '再/d', '到/v', '生病/n', '都/d', '是/v', '坎坎坷坷/z', '的/u', '，/w', '我们/r', '这些/r', '朋友/n', '在/p', '心里/s', '都/d', '很/d', '为/p', '她/r', '难/ad', '过/v', '。/w', '她/r', '的/u', '儿子/n', '叫/v', '陈厦/nr', '，/w', '为什么/r', '呢/y', '？/w', '那/r', '是/v', '因为/c', '，/w', '当年/t', '她/r', '怀着/v', '孩子/n', '的/u', '时候/n', '，/w', '大/a', '着/u', '肚子/n', '坐在/v', '她/r', '丈夫/n', '的/u', '自行车/n', '上/f', '到处/d', '奔波/v', '，/w', '就/d', '是/v', '为了/p', '找/v', '房子/n', '。/w', '他们/r', '来/v', '来回/v', '回搬/v', '了/u', '许多/m', '次家/n', '，/w', '很/d', '长/a', '一段时间/nz', '都/d', '是/v', '处于/v', '这种/r', '颠簸/n', '的/u', '状态/n', '，/w', '所以/c', '她/r', '就/d', '给/p', '孩子/n', '取/v', '名叫/v', '陈厦/nr', '，/w', '希望/v', '自己/r', '的/u', '下一代/n', '不/d', '会/v', '再/d', '有/v', '这样/r', '的/u', '经历/n', '。/w', '她/r', '平时/t', '很/d', '节俭/a', '，/w', '总是/d', '把/p', '经历/n', '放在/v', '了/u', '工作/vn', '上/f', '、/w', '友情/n', '上/f', '。/w', '上个月/t', '我/r', '最后/f', '一/m', '次/q', '见到/v', '她/r', '的/u', '时候/n', '，/w', '她/r', '又/d', '比/p', '以前/f', '瘦/a', '了/u', '好多/m', '。/w', '我们/r', '其实/d', '也/d', '就/d', '料/v', '想到/v', '了/u', '结局/n', '，/w', '但是/c', '这/r', '结局/n', '又/d', '不免/d', '让/v', '我们/r', '难/ad', '过/v', '。/w', '陆星儿/nr', '简介/v', '陆星儿/n', '，/w', '祖籍/n', '江苏/ns', '海门/ns', '，/w', '1949年/t', '11月/t', '生于/v', '上海/ns', '。/w', '1968年/t', '前/f', '在/p', '上海/ns', '读书/v', '；/w', '1978年/t', '考入/v', '中央戏剧学院/ntu', '戏剧/n', '文学系/n', '；/w', '1982年/t', '始任/v', '中国儿童艺术剧院/nt', '编剧/n', '；/w', '1983年/t', '加入/v', '中国作家协会/nt', '，/w', '生前/t', '为/v', '[上海/ns', '作家/n', '协会/n]/nt', '专业/n', '作家/n', '。/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7部/m', '、/w', '中短篇小说/l', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多/m', '部/q', '。/w']]
姓名列表:  {'陆星儿': 7, '甘丹': 1, '陆川': 3, '陆天明': 2, '陈厦': 2}
运行时间差:  0.23921513557434082
------------------------------
NLP分词
词性标注结果:  [['陆星儿/nr', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w', '陆星儿/u', '最让人/n', '敬佩/v', '的/u', '是/v', '毅力/n', '。/w', '本报讯/y', '（/w', '记者/n', '甘丹/nrf', '）/w', '9月4日/t', '晚/Tg', '8时30分/t', '，/w', '著名/a', '女/b', '作家/n', '陆星儿/nr', '因/p', '癌症/n', '医治无效/nz', '，/w', '在/p', '上海/ns', '去世/v', '，/w', '享年/n', '55/m', '岁/q', '。/w', '记者/n', '了解到/v', '，/w', '陆星儿/nr', '的/u', '病情/n', '一直/d', '就/d', '非常/d', '严重/a', '。/w', '在/p', '经过/p', '第二次/m', '手术/v', '以后/f', '，/w', '癌症/n', '细胞/n', '甚至/d', '已经/d', '扩散/v', '到/v', '了/u', '全身/n', '很多/m', '器官/n', '。/w', '然而/c', '她/r', '并不/d', '太/d', '愿意/v', '大家/r', '过多/d', '地/u', '提到/v', '她/r', '的/u', '病情/n', '，/w', '她/r', '总是/d', '不断/d', '地/u', '鼓励/v', '自己/r', '，/w', '希望/v', '自己/r', '能/v', '坚强/a', '地/u', '活/v', '下去/v', '。/w', '陆星儿/nr', '在/p', '生病/vn', '期间/f', '创作/v', '了/u', '长篇小说/l', '《/w', '痛/a', '》/w', '、/w', '以及/c', '长篇/b', '散文/n', '《/w', '用力/v', '呼吸/v', '———/w', '陆星儿/nr', '生命/n', '日记/n', '》/w', '，/w', '这/r', '对于/p', '一个/m', '身患/v', '癌症/n', '的/u', '人/n', '来说/u', '是/v', '件/q', '极其/d', '不/d', '容易/a', '的/u', '事情/n', '。/w', '因/p', '《/w', '寻/v', '枪/n', '》/w', '而出名/i', '的/u', '导演/n', '陆川/nr', '是/v', '陆星儿/nr', '的/u', '侄子/n', '，/w', '他/r', '非常/d', '伤心/a', '，/w', '并/c', '告诉/v', '记者/n', '他/r', '父亲/n', '、/w', '陆星儿/nr', '的/u', '哥哥/n', '著名作家/n', '陆天明/nr', '更为/d', '悲伤/a', '，/w', '已经/d', '飞赴/v', '上海/ns', '。/w', '作家/n', '陈村/ns', '在/p', '接受/v', '记者/n', '采访/vn', '时说/n', '：/w', '“/w', '她/r', '在/p', '生命/n', '的/u', '最后/f', '，/w', '有/v', '儿子/n', '和/c', '许多/m', '朋友/n', '陪/v', '在/p', '她/r', '的/u', '身边/s', '，/w', '也许/d', '还算/v', '一/m', '种/q', '安慰/an', '吧/y', '。/w', '”/w', '亲友/n', '追忆/v', ']/w', '陆川/nr', '：/w', '有/v', '这样/r', '的/u', '姑姑/n', '我/r', '很/d', '荣幸/a', '在/p', '明白/v', '记者/n', '采访/vn', '目的/n', '后/f', '，/w', '陆川/ns', '沉默/a', '了/u', '好几/m', '秒/q', '。/w', '然后/c', '他/r', '说/v', '：/w', '“/w', '我/r', '真的/l', '非常/d', '伤心/a', '。/w', '”/w', '昨天晚上/nz', '做完/v', '了/u', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '试/v', '放到/v', '电影/n', '结尾/n', '时/Ng', '，/w', '接到/v', '了/u', '父亲/n', '（/w', '陆天明/nr', '）/w', '的/u', '电话/n', '，/w', '他/r', '告诉/v', '我/r', '星儿/nz', '姑姑/n', '去世/v', '了/y', '，/w', '真的/z', '非常/d', '伤心/a', '。/w', '我/r', '本来/d', '应该/v', '去/v', '上海/ns', '的/u', '，/w', '但/c', '现在/t', '正/d', '赶/v', '着/u', '做/v', '《/w', '可可西里/nz', '》/w', '的/u', '拷贝/n', '，/w', '离不开/v', '。/w', '我/r', '父母/n', '今天/t', '早上/t', '已经/d', '飞回/v', '上海/ns', '，/w', '我/r', '随后/d', '再/d', '过去/v', '。/w', '姑姑/n', '对/p', '我/r', '很好/l', '，/w', '我/r', '也/d', '很/d', '喜欢/v', '他/r', '。/w', '一直/d', '以来/f', '我/r', '都/d', '以/p', '有/v', '一个/m', '这样/r', '的/u', '姑姑/n', '而/c', '感到/v', '荣幸/a', '，/w', '因为/p', '她/r', '和/c', '我/r', '的/u', '父亲/n', '都/d', '是/v', '从事/v', '文学/n', '的/u', '，/w', '我/r', '觉得/v', '很/d', '了不起/a', '。/w', '她/r', '的/u', '病痛/n', '让/v', '她/r', '很/d', '痛苦/a', '，/w', '但是/c', '姑姑/n', '却/d', '很/d', '坚强/a', '。/w', '现在/t', '离开/v', '对/p', '她/r', '来说/v', '也许/d', '是/v', '一种/m', '解脱/v', '，/w', '我/r', '相信/v', '在/p', '另外/r', '一个/m', '国度/n', '或者/c', '世界/n', '，/w', '姑姑/n', '一定/d', '得到/v', '了/u', '永恒/z', '！/w', '陈村/ns', '：/w', '她/r', '的/u', '一生/n', '都/d', '是/v', '坎坷/a', '的/u', '陆星儿/nr', '平时/t', '是/v', '一个/m', '很/d', '低调/a', '的/u', '人/n', '，/w', '从不/d', '炒作/v', '。/w', '在/p', '工作/vn', '上/f', '，/w', '她/r', '却/d', '特别/a', '的/u', '刻苦/a', '、/w', '勤劳/a', '。/w', '回想/v', '她/r', '的/u', '一生/n', '，/w', '是/v', '那么/r', '的/u', '不/d', '顺利/a', '。/w', '她/r', '从/p', '年轻/a', '时/Ng', '下乡/v', '到/v', '北大荒/ns', '，/w', '到/p', '后来/t', '离婚/v', '一个/m', '人/n', '带着/v', '儿子/n', '生活/vn', '，/w', '再/d', '到/v', '生病/v', '都/d', '是/v', '坎坎坷坷/z', '的/u', '，/w', '我们/r', '这些/r', '朋友/n', '在/p', '心里/s', '都/d', '很/d', '为/p', '她/r', '难过/a', '。/w', '她/r', '的/u', '儿子/n', '叫/v', '陈厦/nr', '，/w', '为什么/r', '呢/y', '？/w', '那/r', '是因为/v', '，/w', '当年/t', '她/r', '怀着/v', '孩子/n', '的/u', '时候/n', '，/w', '大/a', '着/u', '肚子/n', '坐在/v', '她/r', '丈夫/n', '的/u', '自行车/n', '上/f', '到处/d', '奔波/v', '，/w', '就是/d', '为了/p', '找/v', '房子/n', '。/w', '他们/r', '来来回回/nz', '搬/v', '了/u', '许多/m', '次/q', '家/q', '，/w', '很长/n', '一段时间/nz', '都/d', '是/v', '处于/v', '这种/r', '颠簸/vn', '的/u', '状态/n', '，/w', '所以/c', '她/r', '就/d', '给/p', '孩子/n', '取名/v', '叫/v', '陈厦/nr', '，/w', '希望/v', '自己/r', '的/u', '下一代/n', '不会/n', '再/d', '有/v', '这样/r', '的/u', '经历/n', '。/w', '她/r', '平时/t', '很/d', '节俭/a', '，/w', '总是/d', '把/p', '经历/n', '放在/v', '了/u', '工作/vn', '上/f', '、/w', '友情/n', '上/f', '。/w', '上个/b', '月/n', '我/r', '最后/f', '一次/m', '见到/v', '她/r', '的/u', '时候/n', '，/w', '她/r', '又/d', '比/p', '以前/f', '瘦/a', '了/u', '好多/m', '。/w', '我们/r', '其实/d', '也/d', '就/d', '料想/v', '到/v', '了/u', '结局/n', '，/w', '但是/c', '这/r', '结局/n', '又/d', '不免/d', '让/v', '我们/r', '难过/a', '。/w', '陆星儿/u', '简介/n', '陆星儿/nr', '，/w', '祖籍/n', '[江苏/ns', '海门/ns]/ns', '，/w', '1949年11月/t', '生于/v', '上海/ns', '。/w', '1968年前/t', '在/p', '上海/ns', '读书/v', '；/w', '1978年/t', '考入/v', '中央戏剧学院/ntu', '戏剧/n', '文学系/n', '；/w', '1982年/t', '始/Vg', '任/v', '中国儿童艺术剧院/nt', '编剧/n', '；/w', '1983年/t', '加入/v', '中国作家协会/nt', '，/w', '生前/t', '为/v', '[上海/ns', '作家/n', '协会/n]/nt', '专业/n', '作家/n', '。/w', '出版/v', '长篇小说/l', '五/m', '部/q', '、/w', '散文集/n', '7/m', '部/q', '、/w', '中短篇/b', '小说/n', '集/Vg', '10/m', '部/q', '、/w', '影视剧/n', '多部/n', '。/w']]
姓名列表:  {'陆星儿': 10, '甘丹': 1, '陆川': 2, '陆天明': 2, '陈厦': 2}
运行时间差:  2.7586400508880615
------------------------------
人名识别
人名识别结果:  [['[陆/m,', '星儿/nz,', '简介/n,', '陆/m,', '星儿/nz,', '，/w,', '祖籍/n,', '江苏/ns,', '海门/ns,', '，/w,', '出版/v,', '长篇小说/n,', '五/m,', '部/q,', '、/w,', '散文集/n,', '7/m,', '部/q,', '、/w,', '中/f,', '短篇小说/n,', '集/q,', '10/m,', '部/q,', '、/w,', '影视剧/n,', '多/a,', '部/q,', '。/w,', '陆/m,', '星儿/nz,', '最让人/n,', '敬佩/v,', '的/ude1,', '是/vshi,', '毅力/n,', '。/w,', '本报讯/nz,', '（/w,', '记者/nnt,', '甘丹/nrf,', '）/w,', '9月/t,', '4/m,', '日/b,', '晚/tg,', '8/m,', '时/qt,', '30/m,', '分/qt,', '，/w,', '著名/a,', '女作家/nnd,', '陆/m,', '星儿/nz,', '因/p,', '癌症/n,', '医治无效/nz,', '，/w,', '在/p,', '上海/ns,', '去世/vi,', '，/w,', '享年/n,', '55/m,', '岁/qt,', '。/w,', '记者/nnt,', '了解到/v,', '，/w,', '陆/m,', '星儿/nz,', '的/ude1,', '病情/n,', '一直/d,', '就/d,', '非常/d,', '严重/a,', '。/w,', '在/p,', '经过/p,', '第二/mq,', '次/qv,', '手术/n,', '以后/f,', '，/w,', '癌症/n,', '细胞/n,', '甚至/d,', '已经/d,', '扩散/v,', '到/v,', '了/ule,', '全身/n,', '很多/m,', '器官/n,', '。/w,', '然而/c,', '她/rr,', '并不/d,', '太/d,', '愿意/v,', '大家/rr,', '过多/d,', '地/ude2,', '提到/v,', '她/rr,', '的/ude1,', '病情/n,', '，/w,', '她/rr,', '总是/d,', '不断/d,', '地/ude2,', '鼓励/v,', '自己/rr,', '，/w,', '希望/v,', '自己/rr,', '能/v,', '坚强/a,', '地/ude2,', '活下去/v,', '。/w,', '陆/m,', '星儿/nz,', '在/p,', '生病/vi,', '期间/f,', '创作/vn,', '了/ule,', '长篇小说/n,', '《/w,', '痛/a,', '》/w,', '、/w,', '以及/cc,', '长篇/b,', '散文/n,', '《/w,', '用力/ad,', '呼吸/v,', '———/w,', '陆/m,', '星儿/nz,', '生命/n,', '日记/n,', '》/w,', '，/w,', '这/rzv,', '对于/p,', '一个/mq,', '身患/v,', '癌症/n,', '的/ude1,', '人/n,', '来说/uls,', '是/vshi,', '件/q,', '极其/d,', '不/d,', '容易/ad,', '的/ude1,', '事情/n,', '。/w,', '因/p,', '《/w,', '寻枪/nz,', '》/w,', '而出名/i,', '的/ude1,', '导演/nnt,', '陆川/ns,', '是/vshi,', '陆/m,', '星儿/nz,', '的/ude1,', '侄子/n,', '，/w,', '他/rr,', '非常/d,', '伤心/a,', '，/w,', '并/cc,', '告诉/v,', '记者/nnt,', '他/rr,', '父亲/n,', '、/w,', '陆/m,', '星儿/nz,', '的/ude1,', '哥哥/n,', '著名作家/n,', '陆天明/nr,', '更为/d,', '悲伤/a,', '，/w,', '已经/d,', '飞赴/v,', '上海/ns,', '。/w,', '作家/nnt,', '陈村/ns,', '在/p,', '接受/v,', '记者/nnt,', '采访/v,', '时说/n,', '：/w,', '“/w,', '她/rr,', '在/p,', '生命/n,', '的/ude1,', '最后/f,', '，/w,', '有/vyou,', '儿子/n,', '和/cc,', '许多/m,', '朋友/n,', '陪/v,', '在/p,', '她/rr,', '的/ude1,', '身边/s,', '，/w,', '也许/d,', '还算/v,', '一/m,', '种/q,', '安慰/v,', '吧/y,', '。/w,', '”/w,', '亲友/n,', '追忆/v,', ']/w,', '陆川/ns,', '：/w,', '有/vyou,', '这样/rzv,', '的/ude1,', '姑姑/n,', '我/rr,', '很/d,', '荣幸/a,', '在/p,', '明白/v,', '记者/nnt,', '采访/v,', '目的/n,', '后/f,', '，/w,', '陆川/ns,', '沉默/a,', '了/ule,', '好几/mq,', '秒/qt,', '。/w,', '然后/c,', '他/rr,', '说/v,', '：/w,', '“/w,', '我/rr,', '真的/d,', '非常/d,', '伤心/a,', '。/w,', '”/w,', '昨天晚上/nz,', '做完/v,', '了/ule,', '《/w,', '可可西里/nz,', '》/w,', '的/ude1,', '拷贝/n,', '，/w,', '试/v,', '放到/v,', '电影/n,', '结尾/n,', '时/qt,', '，/w,', '接到/v,', '了/ule,', '父亲/n,', '（/w,', '陆天明/nr,', '）/w,', '的/ude1,', '电话/n,', '，/w,', '他/rr,', '告诉/v,', '我/rr,', '星儿/nz,', '姑姑/n,', '去世/vi,', '了/ule,', '，/w,', '真的/d,', '非常/d,', '伤心/a,', '。/w,', '我/rr,', '本来/d,', '应该/v,', '去/vf,', '上海/ns,', '的/ude1,', '，/w,', '但/c,', '现在/t,', '正/d,', '赶着/nz,', '做/v,', '《/w,', '可可西里/nz,', '》/w,', '的/ude1,', '拷贝/n,', '，/w,', '离不开/v,', '。/w,', '我/rr,', '父母/n,', '今天/t,', '早上/t,', '已经/d,', '飞回/vf,', '上海/ns,', '，/w,', '我/rr,', '随后/d,', '再/d,', '过去/vf,', '。/w,', '姑姑/n,', '对/p,', '我/rr,', '很好/ad,', '，/w,', '我/rr,', '也/d,', '很/d,', '喜欢/vi,', '他/rr,', '。/w,', '一直/d,', '以来/f,', '我/rr,', '都以/nr,', '有/vyou,', '一个/mq,', '这样/rzv,', '的/ude1,', '姑姑/n,', '而/cc,', '感到/v,', '荣幸/a,', '，/w,', '因为/c,', '她/rr,', '和/cc,', '我/rr,', '的/ude1,', '父亲/n,', '都/d,', '是/vshi,', '从事/vi,', '文学/n,', '的/ude1,', '，/w,', '我/rr,', '觉得/v,', '很/d,', '了不起/a,', '。/w,', '她/rr,', '的/ude1,', '病痛/n,', '让/v,', '她/rr,', '很/d,', '痛苦/an,', '，/w,', '但是/c,', '姑姑/n,', '却/d,', '很/d,', '坚强/a,', '。/w,', '现在/t,', '离开/v,', '对/p,', '她/rr,', '来说/uls,', '也许/d,', '是/vshi,', '一/m,', '种/q,', '解脱/v,', '，/w,', '我/rr,', '相信/v,', '在/p,', '另外/c,', '一个/mq,', '国度/n,', '或者/c,', '世界/n,', '，/w,', '姑姑/n,', '一定/b,', '得到/v,', '了/ule,', '永恒/z,', '！/w,', '陈村/ns,', '：/w,', '她/rr,', '的/ude1,', '一生/n,', '都/d,', '是/vshi,', '坎坷/an,', '的/ude1,', '陆/m,', '星儿/nz,', '平时/t,', '是/vshi,', '一个/mq,', '很/d,', '低调/n,', '的/ude1,', '人/n,', '，/w,', '从不/d,', '炒作/v,', '。/w,', '在/p,', '工作/vn,', '上/f,', '，/w,', '她/rr,', '却/d,', '特别/d,', '的/ude1,', '刻苦/ad,', '、/w,', '勤劳/a,', '。/w,', '回想/v,', '她/rr,', '的/ude1,', '一生/n,', '，/w,', '是/vshi,', '那么/c,', '的/ude1,', '不/d,', '顺利/ad,', '。/w,', '她/rr,', '从/p,', '年轻时/nz,', '下乡/vi,', '到/v,', '北大荒/ns,', '，/w,', '到/v,', '后来/t,', '离婚/vi,', '一个/mq,', '人/n,', '带着/vn,', '儿子/n,', '生活/vn,', '，/w,', '再/d,', '到/v,', '生病/vi,', '都/d,', '是/vshi,', '坎坎坷坷/z,', '的/ude1,', '，/w,', '我们/rr,', '这些/rz,', '朋友/n,', '在/p,', '心里/s,', '都/d,', '很/d,', '为/p,', '她/rr,', '难过/a,', '。/w,', '她/rr,', '的/ude1,', '儿子/n,', '叫/vi,', '陈厦/nr,', '，/w,', '为什么/ryv,', '呢/y,', '？/w,', '那/rzv,', '是因为/c,', '，/w,', '当年/t,', '她/rr,', '怀着/v,', '孩子/n,', '的/ude1,', '时候/n,', '，/w,', '大/a,', '着/uzhe,', '肚子/n,', '坐在/v,', '她/rr,', '丈夫/n,', '的/ude1,', '自行车/n,', '上/f,', '到处/d,', '奔波/vi,', '，/w,', '就是/v,', '为了/p,', '找/v,', '房子/n,', '。/w,', '他们/rr,', '来来回回/nz,', '搬/v,', '了/ule,', '许多/m,', '次/qv,', '家/q,', '，/w,', '很长/d,', '一段时间/nz,', '都/d,', '是/vshi,', '处于/v,', '这种/r,', '颠簸/vi,', '的/ude1,', '状态/n,', '，/w,', '所以/c,', '她/rr,', '就/d,', '给/p,', '孩子/n,', '取名/v,', '叫/vi,', '陈厦/nr,', '，/w,', '希望/v,', '自己/rr,', '的/ude1,', '下一代/n,', '不会/v,', '再/d,', '有/vyou,', '这样/rzv,', '的/ude1,', '经历/n,', '。/w,', '她/rr,', '平时/t,', '很/d,', '节俭/a,', '，/w,', '总是/d,', '把/pba,', '经历/n,', '放在/v,', '了/ule,', '工作/vn,', '上/f,', '、/w,', '友情/n,', '上/f,', '。/w,', '上个月/t,', '我/rr,', '最后/f,', '一/m,', '次/qv,', '见到/v,', '她/rr,', '的/ude1,', '时候/n,', '，/w,', '她/rr,', '又/d,', '比/p,', '以前/f,', '瘦/a,', '了/ule,', '好多/mq,', '。/w,', '我们/rr,', '其实/d,', '也/d,', '就/d,', '料想到/nz,', '了/ule,', '结局/n,', '，/w,', '但是/c,', '这/rzv,', '结局/n,', '又/d,', '不免/d,', '让/v,', '我们/rr,', '难过/a,', '。/w,', '陆/m,', '星儿/nz,', '简介/n,', '陆/m,', '星儿/nz,', '，/w,', '祖籍/n,', '江苏/ns,', '海门/ns,', '，/w,', '1949/m,', '年/qt,', '11月/t,', '生于/v,', '上海/ns,', '。/w,', '1968/m,', '年前/t,', '在/p,', '上海/ns,', '读书/vi,', '；/w,', '1978/m,', '年/qt,', '考入/v,', '中央戏剧学院/ntu,', '戏剧/n,', '文学系/nit,', '；/w,', '1982/m,', '年/qt,', '始/vg,', '任/v,', '中国儿童艺术剧院/nt,', '编剧/nnt,', '；/w,', '1983/m,', '年/qt,', '加入/v,', '中国作家协会/nt,', '，/w,', '生前/t,', '为/p,', '上海/ns,', '作家/nnt,', '协会/nis,', '专业/n,', '作家/nnt,', '。/w,', '出版/v,', '长篇小说/n,', '五/m,', '部/q,', '、/w,', '散文集/n,', '7/m,', '部/q,', '、/w,', '中/f,', '短篇小说/n,', '集/q,', '10/m,', '部/q,', '、/w,', '影视剧/n,', '多/a,', '部/q,', '。/w]']]
姓名列表:  {}
运行时间差:  0.057090044021606445
------------------------------
"""